advanced/pipe3D_codedInlet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.01;

xmin -15;
xmax 45;
ymin -15;
ymax 5;
zmin -5;
zmax 15;

// xCells #eval "$xmin + $xmax";
// yCells #eval "$ymin + $ymax";
// zCells #eval "$zmin + $zmax";

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
	
	($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 20 20) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
			(0 4 7 3)
        );
    }
	
	outlet
    {
        type patch;
        faces
        (
			(1 2 6 5)
        );
    }
	
	front
    {
        type empty;
        faces
        (
			(4 5 6 7) // front
        );
    }
	
	back
    {
        type empty;
        faces
        (
			(0 1 2 3) // back
        );
    }

	top
    {
        type patch;
        faces
        (
			(3 7 6 2) // top		
        );
    }

    bottom
    {
        type patch;
        faces
        (
			(0 4 5 1) // bottom
        );
    }

);

// ************************************************************************* //
